general_bases_java/example_projects/spring_boot_comparison_concurrency/target/classes/request_complete.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="urn:sap-com:document:sap:rfc:functions">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:_-POSDW_-BAPI_POSTR_CREATE>
            <CUSTOMERDETAILS>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <CUSTOMERINFORMATIONTYPECODE>BAS</CUSTOMERINFORMATIONTYPECODE>
                    <DATAELEMENTID>NOMBRE</DATAELEMENTID>
                    <DATAELEMENTVALUE>Gloria Estefan</DATAELEMENTVALUE>
                    <CUSTOMERDETAILSSEQUENCENUMBER></CUSTOMERDETAILSSEQUENCENUMBER>
                </item>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <CUSTOMERINFORMATIONTYPECODE>BAS</CUSTOMERINFORMATIONTYPECODE>
                    <DATAELEMENTID>ID</DATAELEMENTID>
                    <DATAELEMENTVALUE>12456999</DATAELEMENTVALUE>
                    <CUSTOMERDETAILSSEQUENCENUMBER></CUSTOMERDETAILSSEQUENCENUMBER>
                </item>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <CUSTOMERINFORMATIONTYPECODE>BAS</CUSTOMERINFORMATIONTYPECODE>
                    <DATAELEMENTID>TIPOID</DATAELEMENTID>
                    <DATAELEMENTVALUE>CEDULA</DATAELEMENTVALUE>
                    <CUSTOMERDETAILSSEQUENCENUMBER></CUSTOMERDETAILSSEQUENCENUMBER>
                </item>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <CUSTOMERINFORMATIONTYPECODE>TELE</CUSTOMERINFORMATIONTYPECODE>
                    <DATAELEMENTID>TELEFONO</DATAELEMENTID>
                    <DATAELEMENTVALUE>+1 (305) 456-6546</DATAELEMENTVALUE>
                    <CUSTOMERDETAILSSEQUENCENUMBER></CUSTOMERDETAILSSEQUENCENUMBER>
                </item>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <CUSTOMERINFORMATIONTYPECODE>DIRE</CUSTOMERINFORMATIONTYPECODE>
                    <DATAELEMENTID>DIRECCION</DATAELEMENTID>
                    <DATAELEMENTVALUE>Miami, FL</DATAELEMENTVALUE>
                    <CUSTOMERDETAILSSEQUENCENUMBER></CUSTOMERDETAILSSEQUENCENUMBER>
                </item>
            </CUSTOMERDETAILS>
            <I_COMMIT>X</I_COMMIT>
            <I_LOCKWAIT>5</I_LOCKWAIT>
            <LINEITEMDISCOUNT>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <RETAILSEQUENCENUMBER>1</RETAILSEQUENCENUMBER>
                    <DISCOUNTSEQUENCENUMBER>1</DISCOUNTSEQUENCENUMBER>
                    <DISCOUNTTYPECODE>ZDPO</DISCOUNTTYPECODE>
                    <DISCOUNTREASONCODE></DISCOUNTREASONCODE>
                    <REDUCTIONAMOUNT>1000</REDUCTIONAMOUNT>
                    <STOREFINANCIALLEDGERACCOUNTID></STOREFINANCIALLEDGERACCOUNTID>
                    <DISCOUNTID></DISCOUNTID>
                    <DISCOUNTIDQUALIFIER></DISCOUNTIDQUALIFIER>
                    <BONUSBUYID></BONUSBUYID>
                    <OFFERID></OFFERID>
                    <DISCOUNTID_LONG></DISCOUNTID_LONG>
                </item>
            </LINEITEMDISCOUNT>
            <LINEITEMTAX>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <RETAILSEQUENCENUMBER>1</RETAILSEQUENCENUMBER>
                    <TAXSEQUENCENUMBER>1</TAXSEQUENCENUMBER>
                    <TAXTYPECODE>TXF1</TAXTYPECODE>
                    <TAXAMOUNT>650</TAXAMOUNT>
                    <TAXCLASSIFICATION>6</TAXCLASSIFICATION>
                </item>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <RETAILSEQUENCENUMBER>2</RETAILSEQUENCENUMBER>
                    <TAXSEQUENCENUMBER>1</TAXSEQUENCENUMBER>
                    <TAXTYPECODE>TXF1</TAXTYPECODE>
                    <TAXAMOUNT>0</TAXAMOUNT>
                    <TAXCLASSIFICATION>0</TAXCLASSIFICATION>
                </item>
            </LINEITEMTAX>
            <LINEITEMTAXEXT>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <RETAILSEQUENCENUMBER>1</RETAILSEQUENCENUMBER>
                    <TAXSEQUENCENUMBER>1</TAXSEQUENCENUMBER>
                    <FIELDGROUP>IMP</FIELDGROUP>
                    <FIELDNAME>PORCENTAJE</FIELDNAME>
                    <FIELDVALUE>13</FIELDVALUE>
                </item>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <RETAILSEQUENCENUMBER>2</RETAILSEQUENCENUMBER>
                    <TAXSEQUENCENUMBER>1</TAXSEQUENCENUMBER>
                    <FIELDGROUP>IMP</FIELDGROUP>
                    <FIELDNAME>PORCENTAJE</FIELDNAME>
                    <FIELDVALUE>0</FIELDVALUE>
                </item>
            </LINEITEMTAXEXT>
            <RETAILLINEITEM>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <RETAILSEQUENCENUMBER>1</RETAILSEQUENCENUMBER>
                    <RETAILTYPECODE>1021</RETAILTYPECODE>
                    <RETAILREASONCODE></RETAILREASONCODE>
                    <ITEMIDQUALIFIER>2</ITEMIDQUALIFIER>
                    <ITEMID>100000002</ITEMID>
                    <RETAILQUANTITY>2</RETAILQUANTITY>
                    <SALESUNITOFMEASURE>ST</SALESUNITOFMEASURE>
                    <SALESUNITOFMEASURE_ISO></SALESUNITOFMEASURE_ISO>
                    <SALESAMOUNT>5650</SALESAMOUNT>
                    <NORMALSALESAMOUNT>6000</NORMALSALESAMOUNT>
                    <COST></COST>
                    <BATCHID></BATCHID>
                    <SERIALNUMBER></SERIALNUMBER>
                    <PROMOTIONID></PROMOTIONID>
                    <ITEMIDENTRYMETHODCODE>SCAN</ITEMIDENTRYMETHODCODE>
                    <ACTUALUNITPRICE>2500</ACTUALUNITPRICE>
                    <UNITS>2</UNITS>
                    <SCANTIME></SCANTIME>
                    <NONEXISTENTARTICLEID></NONEXISTENTARTICLEID>
                    <NONEXISTENTEAN></NONEXISTENTEAN>
                    <ENTEREDEAN></ENTEREDEAN>
                    <ORIGRETAILSTOREID></ORIGRETAILSTOREID>
                    <ORIGBUSINESSDAYDATE></ORIGBUSINESSDAYDATE>
                    <ORIGWORKSTATIONID></ORIGWORKSTATIONID>
                    <ORIGTRANSNUMBER></ORIGTRANSNUMBER>
                    <ORIGBEGINTIMESTAMP></ORIGBEGINTIMESTAMP>
                    <ORIGREASONCODE></ORIGREASONCODE>
                    <ORIGLINEITEMNUMBER></ORIGLINEITEMNUMBER>
                    <LOGSYS></LOGSYS>
                    <ITEMID_LONG></ITEMID_LONG>
                    <NONEXISTENTARTICLEID_LONG></NONEXISTENTARTICLEID_LONG>
                    <PRICETYPECODE>05</PRICETYPECODE>
                    <ORDER_CHANNEL></ORDER_CHANNEL>
                </item>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <RETAILSEQUENCENUMBER>2</RETAILSEQUENCENUMBER>
                    <RETAILTYPECODE>1022</RETAILTYPECODE>
                    <RETAILREASONCODE></RETAILREASONCODE>
                    <ITEMIDQUALIFIER>2</ITEMIDQUALIFIER>
                    <ITEMID>100000002</ITEMID>
                    <RETAILQUANTITY>3</RETAILQUANTITY>
                    <SALESUNITOFMEASURE>ST</SALESUNITOFMEASURE>
                    <SALESUNITOFMEASURE_ISO></SALESUNITOFMEASURE_ISO>
                    <SALESAMOUNT>3000</SALESAMOUNT>
                    <NORMALSALESAMOUNT>3000</NORMALSALESAMOUNT>
                    <COST></COST>
                    <BATCHID></BATCHID>
                    <SERIALNUMBER></SERIALNUMBER>
                    <PROMOTIONID></PROMOTIONID>
                    <ITEMIDENTRYMETHODCODE>SCAN</ITEMIDENTRYMETHODCODE>
                    <ACTUALUNITPRICE>1000</ACTUALUNITPRICE>
                    <UNITS>3</UNITS>
                    <SCANTIME></SCANTIME>
                    <NONEXISTENTARTICLEID></NONEXISTENTARTICLEID>
                    <NONEXISTENTEAN></NONEXISTENTEAN>
                    <ENTEREDEAN></ENTEREDEAN>
                    <ORIGRETAILSTOREID></ORIGRETAILSTOREID>
                    <ORIGBUSINESSDAYDATE></ORIGBUSINESSDAYDATE>
                    <ORIGWORKSTATIONID></ORIGWORKSTATIONID>
                    <ORIGTRANSNUMBER></ORIGTRANSNUMBER>
                    <ORIGBEGINTIMESTAMP></ORIGBEGINTIMESTAMP>
                    <ORIGREASONCODE></ORIGREASONCODE>
                    <ORIGLINEITEMNUMBER></ORIGLINEITEMNUMBER>
                    <LOGSYS></LOGSYS>
                    <ITEMID_LONG></ITEMID_LONG>
                    <NONEXISTENTARTICLEID_LONG></NONEXISTENTARTICLEID_LONG>
                    <PRICETYPECODE></PRICETYPECODE>
                    <ORDER_CHANNEL></ORDER_CHANNEL>
                </item>
            </RETAILLINEITEM>
            <RETURN>
                <item>
                    <TYPE></TYPE>
                    <ID></ID>
                    <NUMBER></NUMBER>
                    <MESSAGE></MESSAGE>
                    <LOG_NO></LOG_NO>
                    <LOG_MSG_NO></LOG_MSG_NO>
                    <MESSAGE_V1></MESSAGE_V1>
                    <MESSAGE_V2></MESSAGE_V2>
                    <MESSAGE_V3></MESSAGE_V3>
                    <MESSAGE_V4></MESSAGE_V4>
                    <PARAMETER></PARAMETER>
                    <ROW></ROW>
                    <FIELD></FIELD>
                    <SYSTEM></SYSTEM>
                </item>
            </RETURN>
            <TENDER>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <TENDERSEQUENCENUMBER>1</TENDERSEQUENCENUMBER>
                    <TENDERTYPECODE>ZPE1</TENDERTYPECODE>
                    <TENDERAMOUNT>8650</TENDERAMOUNT>
                    <TENDERCURRENCY>CRC</TENDERCURRENCY>
                    <TENDERCURRENCY_ISO>CRC</TENDERCURRENCY_ISO>
                    <TENDERID></TENDERID>
                    <ACCOUNTNUMBER></ACCOUNTNUMBER>
                    <REFERENCEID></REFERENCEID>
                </item>
            </TENDER>
            <TRANSACTION>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <BEGINDATETIMESTAMP>20240621100500</BEGINDATETIMESTAMP>
                    <ENDDATETIMESTAMP>20240621101000</ENDDATETIMESTAMP>
                    <DEPARTMENT></DEPARTMENT>
                    <OPERATORQUALIFIER></OPERATORQUALIFIER>
                    <OPERATORID>CAJERO-001</OPERATORID>
                    <TRANSACTIONCURRENCY>CRC</TRANSACTIONCURRENCY>
                    <TRANSACTIONCURRENCY_ISO>CRC</TRANSACTIONCURRENCY_ISO>
                    <PARTNERQUALIFIER></PARTNERQUALIFIER>
                    <PARTNERID></PARTNERID>
                    <ACTIVITYTIME></ACTIVITYTIME>
                    <REGISTERTIME></REGISTERTIME>
                    <TENDERTIME></TENDERTIME>
                    <PAUSETIME></PAUSETIME>
                    <TRAININGTIME></TRAININGTIME>
                    <TILLID></TILLID>
                    <CUSTOMERIDPOS>12456999</CUSTOMERIDPOS>
                    <CUSTOMERAGE></CUSTOMERAGE>
                    <CUSTOMERENTRYMETHOD></CUSTOMERENTRYMETHOD>
                    <ORIGRETAILSTOREID></ORIGRETAILSTOREID>
                    <ORIGBUSINESSDAYDATE></ORIGBUSINESSDAYDATE>
                    <ORIGWORKSTATIONID></ORIGWORKSTATIONID>
                    <ORIGTRANSNUMBER></ORIGTRANSNUMBER>
                    <ORIGBEGINTIMESTAMP></ORIGBEGINTIMESTAMP>
                    <ORIGREASONCODE></ORIGREASONCODE>
                    <ORIGLINEITEMNUMBER></ORIGLINEITEMNUMBER>
                    <LOGSYS></LOGSYS>
                </item>
            </TRANSACTION>
            <TRANSACTIONEXT>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <FIELDGROUP>FEL</FIELDGROUP>
                    <FIELDNAME>NUMDOC</FIELDNAME>
                    <FIELDVALUE>98765432109876543210</FIELDVALUE>
                </item>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <FIELDGROUP>FEL</FIELDGROUP>
                    <FIELDNAME>CLVNUMDOC1</FIELDNAME>
                    <FIELDVALUE>9876543210987654321098765</FIELDVALUE>
                </item>
                <item>
                    <RETAILSTOREID>CR02</RETAILSTOREID>
                    <BUSINESSDAYDATE>2024-06-21</BUSINESSDAYDATE>
                    <TRANSACTIONTYPECODE>1001</TRANSACTIONTYPECODE>
                    <WORKSTATIONID>10</WORKSTATIONID>
                    <TRANSACTIONSEQUENCENUMBER>301</TRANSACTIONSEQUENCENUMBER>
                    <FIELDGROUP>FEL</FIELDGROUP>
                    <FIELDNAME>CLVNUMDOC2</FIELDNAME>
                    <FIELDVALUE>9876543210987654321098765</FIELDVALUE>
                </item>
            </TRANSACTIONEXT>
        </urn:_-POSDW_-BAPI_POSTR_CREATE>
    </soapenv:Body>
</soapenv:Envelope>